anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32FxQI/K1986VE9xI.svd
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER01_MASK</name>
                    <addressOffset>0x00000508</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER01_FILTER</name>
                    <addressOffset>0x0000050C</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER02_MASK</name>
                    <addressOffset>0x00000510</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER02_FILTER</name>
                    <addressOffset>0x00000514</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER03_MASK</name>
                    <addressOffset>0x00000518</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER03_FILTER</name>
                    <addressOffset>0x0000051C</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER04_MASK</name>
                    <addressOffset>0x00000520</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER04_FILTER</name>
                    <addressOffset>0x00000524</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER05_MASK</name>
                    <addressOffset>0x00000528</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER05_FILTER</name>
                    <addressOffset>0x0000052C</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER06_MASK</name>
                    <addressOffset>0x00000530</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER06_FILTER</name>
                    <addressOffset>0x00000534</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER07_MASK</name>
                    <addressOffset>0x00000538</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER07_FILTER</name>
                    <addressOffset>0x0000053C</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER08_MASK</name>
                    <addressOffset>0x00000540</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER08_FILTER</name>
                    <addressOffset>0x00000544</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER09_MASK</name>
                    <addressOffset>0x00000548</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER09_FILTER</name>
                    <addressOffset>0x0000054C</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER10_MASK</name>
                    <addressOffset>0x00000550</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER10_FILTER</name>
                    <addressOffset>0x00000554</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER11_MASK</name>
                    <addressOffset>0x00000558</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER11_FILTER</name>
                    <addressOffset>0x0000055C</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER12_MASK</name>
                    <addressOffset>0x00000560</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER12_FILTER</name>
                    <addressOffset>0x00000564</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER13_MASK</name>
                    <addressOffset>0x00000568</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER13_FILTER</name>
                    <addressOffset>0x0000056C</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER14_MASK</name>
                    <addressOffset>0x00000570</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER14_FILTER</name>
                    <addressOffset>0x00000574</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER15_MASK</name>
                    <addressOffset>0x00000578</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER15_FILTER</name>
                    <addressOffset>0x0000057C</addressOffset>
                </register>
