anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32FxQI/K1986VE9xI.svd
                <register derivedFrom="SEP0_NTS">
                    <name>SEP1_NTS</name>
                    <addressOffset>0x0000011C</addressOffset>
                </register>
                <register derivedFrom="SEP0_CTRL">
                    <name>SEP2_CTRL</name>
                    <addressOffset>0x00000120</addressOffset>
                </register>
                <register derivedFrom="SEP0_STS">
                    <name>SEP2_STS</name>
                    <addressOffset>0x00000124</addressOffset>
                </register>
                <register derivedFrom="SEP0_TS">
                    <name>SEP2_TS</name>
                    <addressOffset>0x00000128</addressOffset>
                </register>
                <register derivedFrom="SEP0_NTS">
                    <name>SEP2_NTS</name>
                    <addressOffset>0x0000012C</addressOffset>
                </register>
                <register derivedFrom="SEP0_CTRL">
                    <name>SEP3_CTRL</name>
                    <addressOffset>0x00000130</addressOffset>
                </register>
                <register derivedFrom="SEP0_STS">
                    <name>SEP3_STS</name>
                    <addressOffset>0x00000134</addressOffset>
                </register>
                <register derivedFrom="SEP0_TS">
                    <name>SEP3_TS</name>
                    <addressOffset>0x00000138</addressOffset>
                </register>
                <register derivedFrom="SEP0_NTS">
                    <name>SEP3_NTS</name>
                    <addressOffset>0x0000013C</addressOffset>
                </register>
                <register>
                    <name>SC</name>
                    <description>USB_SC Register</description>
                    <addressOffset>0x00000140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000003F</resetMask>
                    <fields>
                        <field>
                            <name>SCGEN</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCTXLS</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCDC</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCFSP</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCFSR</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLS</name>
                    <addressOffset>0x00000144</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>SCRXLS</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SIS</name>
                    <description>USB_SIS Register</description>
                    <addressOffset>0x00000148</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001F</resetMask>
                    <fields>
                        <field>
                            <name>SCTDONE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCRESUME</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCRESETEV</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCSOFREC</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCNAKSENT</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SIM</name>
                    <description>USB_SIM Register</description>
                    <addressOffset>0x0000014C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000001F</resetMask>
                    <fields>
                        <field>
                            <name>SCTDONEIE</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCRESUMEIE</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCRESETEVIE</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCSOFRECIE</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCNAKSENTIE</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SA</name>
                    <addressOffset>0x00000150</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x0000007F</resetMask>
                    <fields>
                        <field>
                            <name>SCDEVADDR</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFN_L</name>
                    <addressOffset>0x00000154</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <fields>
                        <field>
                            <name>FRAMENUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFN_H</name>
                    <addressOffset>0x00000158</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>FRAMENUM</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEP_FIFO0_RXFD</name>
                    <addressOffset>0x00000180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <fields>
                        <field>
                            <name>RXFIFODATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEP_FIFO0_RXFDC_L</name>
                    <addressOffset>0x00000188</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <fields>
                        <field>
                            <name>FIFODATACOUNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEP_FIFO0_RXFDC_H</name>
                    <addressOffset>0x0000018C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <fields>
                        <field>
                            <name>FIFODATACOUNT</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEP_FIFO0_RXFC</name>
                    <addressOffset>0x00000190</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>FIFOFORCEEMPTY</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEP_FIFO0_TXFD</name>
                    <addressOffset>0x000001C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000000FF</resetMask>
                    <fields>
                        <field>
                            <name>TXFIFODATA</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SEP_FIFO0_TXFDC</name>
                    <addressOffset>0x000001D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>FIFOFORCEEMPTY</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="SEP_FIFO0_RXFD">
                    <name>SEP_FIFO1_RXFD</name>
                    <addressOffset>0x00000200</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_RXFDC_L">
                    <name>SEP_FIFO1_RXFDC_L</name>
                    <addressOffset>0x00000208</addressOffset>
                </register>
                <register derivedFrom="SEP_FIFO0_RXFDC_H">
                    <name>SEP_FIFO1_RXFDC_H</name>
                    <addressOffset>0x0000020C</addressOffset>
                </register>
