anisyanka/milandr-fvp-joy/libs/STDPeriph/SVD/MDR32FxQI/K1986VE9xI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>MDR_RST_CLK</name>
            <version>1.0</version>
            <description>RST_CLK</description>
            <groupName>RST_CLK</groupName>
            <baseAddress>0x40020000</baseAddress>
            <size>32</size>
            <access>read-write</access>
            <addressBlock>
                <offset>0</offset>
                <size>0x1000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CLOCK_STATUS</name>
                    <description>Clock Status Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000007</resetMask>
                    <fields>
                        <field>
                            <name>PLL_USB_RDY</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLL_CPU_RDY</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSE_RDY</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL_CONTROL</name>
                    <description>PLL Control Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000FFF</resetMask>
                    <fields>
                        <field>
                            <name>PLL_USB_ON</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL_USB_RLD</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL_CPU_ON</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL_CPU_RLD</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL_USB_MUL</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL_CPU_MUL</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HS_CONTROL</name>
                    <description>HS Control Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000003</resetMask>
                    <fields>
                        <field>
                            <name>HSE_ON</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSE_BYP</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPU_CLOCK</name>
                    <description>CPU Clock Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003F7</resetMask>
                    <fields>
                        <field>
                            <name>CPU_C1_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HSI</name>
                                    <description>HSI selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSI/2</name>
                                    <description>HSI/2 selected</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE</name>
                                    <description>HSE selected</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE/2</name>
                                    <description>HSE/2 selected</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CPU_C2_SEL</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CPU_C1</name>
                                    <description>CPU_C1 selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLCPUo</name>
                                    <description>PLLCPUo selected</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CPU_C3_SEL</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLK_SEL</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HSI</name>
                                    <description>HSI selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CPU_C3</name>
                                    <description>CPU_C3 selected</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSE</name>
                                    <description>LSE selected</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI</name>
                                    <description>LSI selected</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USB_CLOCK</name>
                    <description>USB Clock Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000117</resetMask>
                    <fields>
                        <field>
                            <name>USB_C1_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HSI</name>
                                    <description>HSI selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSI/2</name>
                                    <description>HSI/2 selected</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE</name>
                                    <description>HSE selected</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSE/2</name>
                                    <description>HSE/2 selected</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>USB_C2_SEL</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>USB_C1</name>
                                    <description>USB_C1 selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PLLUSBo</name>
                                    <description>PLLUSBo selected</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>USB_C3_SEL</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>USB_C2</name>
                                    <description>USB_C2 selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>USB_C2/2</name>
                                    <description>USB_C2/2 selected</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>USB_CLK_EN</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_MCO_CLOCK</name>
                    <description>ADC Clock Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00003F33</resetMask>
                    <fields>
                        <field>
                            <name>ADC_C1_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CPU_C1</name>
                                    <description>CPU_C1 selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>USB_C1</name>
                                    <description>USB_C1 selected</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CPU_C2</name>
                                    <description>CPU_C2 selected</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>USB_C2</name>
                                    <description>USB_C2 selected</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADC_C2_SEL</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LSE</name>
                                    <description>LSE selected</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LSI</name>
                                    <description>LSI selected</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ADC_C1</name>
                                    <description>ADC_C1 selected</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HSI_C1</name>
                                    <description>HSI_C1 selected</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ADC_C3_SEL</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC_CLK_EN</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_CLOCK</name>
                    <description>RTC Clock Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003FF</resetMask>
                    <fields>
                        <field>
                            <name>HSE_SEL</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSI_SEL</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSE_RTC_EN</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSI_RTC_EN</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
